{
  "name": "09.16-Deeptools: plotFingerprint",
  "script_path": "conf/scripts/plotFingerprint.sh",
  "description": "This quality control will most likely be of interest for you if you are dealing with ChIP-seq samples as a pressing question in ChIP-seq experiments is “Did my ChIP work?”, i.e. did the antibody-treatment enrich sufficiently so that the ChIP signal can be separated from the background signal? (After all, around 90% of all DNA fragments in a ChIP experiment will represent the genomic background)",
  "working_directory": "./",
  "parameters": [
    {
      "name": "Bam inputs",
      "param": "--bamfiles",
      "required": true,
      "description": "List of BAM files to process"
    },
    {
      "name": "Output",
      "param": "-o",
      "description": "File name of the output figure. The file ending will be used to determine the image format. The available options are typically: “png”, “eps”, “pdf” and “svg”, e.g. : fingerprint.png"
    },
    {
      "name": "Labels",
      "param": "-l",
      "description": "List of labels to use in the output. If not given, the file names will be used instead. Separate the labels by spaces"
    },
    {
      "name": "Bin size",
      "param": "--binSize",
      "description": "Window size in base pairs to sample the genome"
    },
    {
      "name": "Number of samples",
      "param": "-n",
      "description": "Number of bins that sampled from the genome, for which the overlapping number of reads is computed"
    },
    {
      "name": "Plot format",
      "param": "--plotFileFormat",
      "description": "Image format type. If given, this option overrides theimage format based on the plotFile ending. Theavailable options are: png, eps, pdf, svg and plotly.",
      "type": "list",
      "values": [
        "png",
        "pdf",
        "svg",
        "eps",
        "plotly"
      ]
    },
    {
      "name": "Title",
      "param": "--plotTitle",
      "description": "Title of the plot, to be printed on top of the generated image. Leave blank for no title"
    },
    {
      "name": "Processors",
      "param": "--numberOfProcessors",
      "description": "Number of processors to use. The default is to use 1."
    },
    {
      "name": "Black list",
      "param": "--blackListFileName",
      "type": "file_upload",
      "description": "A BED file containing regions that should be excludedfrom all analyses. Currently this works by rejectinggenomic chunks that happen to overlap an entry.Consequently, for BAM files, if a read partiallyoverlaps a blacklisted region or a fragment spans overit, then the read/fragment might still be considered."
    },
    {
      "name": "Other parameters",
      "description": "Other parameters"
    },
    {
      "name": "Help",
      "param": "--h",
      "description": "Show the help message and exit",
      "no_value": true,
      "default": false
    }
  ]
}
